#include "stdafx.h"
#include "AlgOidName.h"


const int  AlgOidName::line_count = 58;

//Взыто с https://cpdn.cryptopro.ru/content/csp40/html/group___pro_c_s_p_ex_DP8.html
const string  AlgOidName::Oid[58][3] =
{
	//Параметр	Индекс	Значение параметра
	{ "szOID_CP_GOST_28147",	"1.2.643.2.2.21","Алгоритм шифрования ГОСТ 28147-89" },
	{ "szOID_CP_GOST_R3411",	"1.2.643.2.2.9",	"Функция хэширования ГОСТ Р 34.11-94" },
	{ "szOID_CP_GOST_R3411_12_256","1.2.643.7.1.1.2.2","Функция хэширования ГОСТ Р 34.11-2012, длина выхода 256 бит" },
	{ "szOID_CP_GOST_R3411_12_512","1.2.643.7.1.1.2.3","Функция хэширования ГОСТ Р 34.11-2012, длина выхода 512 бит" },
	{ "szOID_CP_GOST_R3410","1.2.643.2.2.20",	"Алгоритм ГОСТ Р 34.10-94, используемый при экспорте/импорте ключей" },
	{ "szOID_CP_GOST_R3410EL","1.2.643.2.2.19","Алгоритм ГОСТ Р 34.10-2001, используемый при экспорте/импорте ключей" },
	{ "szOID_CP_GOST_R3410_12_256","1.2.643.7.1.1.1.1","Алгоритм ГОСТ Р 34.10-2012 для ключей длины 256 бит, используемый при экспорте/импорте ключей" },
	{ "szOID_CP_GOST_R3410_12_512","1.2.643.7.1.1.1.2","Алгоритм ГОСТ Р 34.10-2012 для ключей длины 512 бит, используемый при экспорте/импорте ключей" },
	{ "szOID_CP_DH_EX","1.2.643.2.2.99","Алгоритм Диффи-Хеллмана на базе потенциальной функции" },
	{ "szOID_CP_DH_EL","1.2.643.2.2.98","Алгоритм Диффи-Хеллмана на базе эллиптической кривой" },
	{ "szOID_CP_DH_12_256","1.2.643.7.1.1.6.1","Алгоритм Диффи-Хеллмана на базе эллиптической кривой для ключей длины 256 бит" },
	{ "szOID_CP_DH_12_512","1.2.643.7.1.1.6.2","Алгоритм Диффи-Хеллмана на базе эллиптической кривой для ключей длины 512 бит" },
	{ "szOID_CP_GOST_R3411_R3410","1.2.643.2.2.4","Алгоритм цифровой подписи ГОСТ Р 34.10-94" },
	{ "szOID_CP_GOST_R3411_R3410EL","1.2.643.2.2.3","Алгоритм цифровой подписи ГОСТ Р 34.10-2001" },
	{ "szOID_CP_GOST_R3411_12_256_R3410",	"1.2.643.7.1.1.3.2","Алгоритм цифровой подписи ГОСТ Р 34.10-2012 для ключей длины 256 бит" },
	{ "szOID_CP_GOST_R3411_12_512_R3410",	"1.2.643.7.1.1.3.3","Алгоритм цифровой подписи ГОСТ Р 34.10-2012 для ключей длины 512 бит" },
	{ "szOID_KP_TLS_PROXY","1.2.643.2.2.34.1","Аудит TLS-трафика" },
	{ "szOID_KP_RA_CLIENT_AUTH","1.2.643.2.2.34.2","Идентификация пользователя на центре регистрации" },
	{ "szOID_KP_WEB_CONTENT_SIGNING",	"1.2.643.2.2.34.3",	"Подпись содержимого сервера Интернет" },
	{ "szOID_GostR3411_94_TestParamSet"	"1.2.643.2.2.30.0"	,"Тестовый узел замены" },
	{ "szOID_GostR3411_94_CryptoProParamSet"	"1.2.643.2.2.30.1"	,"Узел замены функции хэширования по умолчанию, вариант ""Верба-О""" },
	{ "szOID_GostR3411_94_CryptoPro_B_ParamSet",	"1.2.643.2.2.30.2"	,"Узел замены функции хэширования, вариант 1" },
	{ "szOID_GostR3411_94_CryptoPro_C_ParamSet",	"1.2.643.2.2.30.3"	,"Узел замены функции хэширования, вариант 2" },
	{ "szOID_GostR3411_94_CryptoPro_D_ParamSet",	"1.2.643.2.2.30.4"	,"Узел замены функции хэширования, вариант 3" },
	{ "szOID_Gost28147_89_TestParamSet",	"1.2.643.2.2.31.0"	,"Тестовый узел замены алгоритма шифрования" },
	{ "szOID_Gost28147_89_CryptoPro_A_ParamSet",	"1.2.643.2.2.31.1"	,"Узел замены алгоритма шифрования по умолчанию, вариант ""Верба-О""" },
	{ "szOID_Gost28147_89_CryptoPro_B_ParamSet",	"1.2.643.2.2.31.2"	,"Узел замены алгоритма шифрования, вариант 1" },
	{ "szOID_Gost28147_89_CryptoPro_C_ParamSet",	"1.2.643.2.2.31.3"	,"Узел замены алгоритма шифрования, вариант 2" },
	{ "szOID_Gost28147_89_CryptoPro_D_ParamSet",	"1.2.643.2.2.31.4"	,"Узел замены алгоритма шифрования, вариант 3" },
	{ "szOID_Gost28147_89_CryptoPro_Oscar_1_1_ParamSet",	"1.2.643.2.2.31.5"	,"Узел замены, вариант карты КриптоРИК" },
	{ "szOID_Gost28147_89_CryptoPro_Oscar_1_0_ParamSet",	"1.2.643.2.2.31.6"	,"Узел замены, используемый при шифровании с хэшированием" },
	{ "szOID_Gost28147_89_TC26_A_ParamSet",	"1.2.643.2.2.31.12"	,"Узел замены алгоритма шифрования, вариант ТК26 2" },
	{ "szOID_Gost28147_89_TC26_B_ParamSet",	"1.2.643.2.2.31.13"	,"Узел замены алгоритма шифрования, вариант ТК26 1" },
	{ "szOID_Gost28147_89_TC26_C_ParamSet",	"1.2.643.2.2.31.14","Узел замены алгоритма шифрования, вариант ТК26 3" },
	{ "szOID_Gost28147_89_TC26_D_ParamSet",	"1.2.643.2.2.31.15"	,"Узел замены алгоритма шифрования, вариант ТК26 4" },
	{ "szOID_Gost28147_89_TC26_E_ParamSet",	"1.2.643.2.2.31.16"	,"Узел замены алгоритма шифрования, вариант ТК26 5" },
	{ "szOID_Gost28147_89_TC26_F_ParamSet",	"1.2.643.2.2.31.17"	,"Узел замены алгоритма шифрования, вариант ТК26 6" },
	{ "szOID_Gost28147_89_TC26_Z_ParamSet",	"1.2.643.7.1.2.5.1.1"	,"Узел замены алгоритма шифрования, вариант ТК26 Z" },
	{ "szOID_GostR3410_94_CryptoPro_A_ParamSet",	"1.2.643.2.2.32.2"	,"Параметры P, Q, A цифровой подписи ГОСТ Р 34.10-94, вариант ""Верба-О"". Могут использоваться также в алгоритме Диффи-Хеллмана" },
	{ "szOID_GostR3410_94_CryptoPro_B_ParamSet",	"1.2.643.2.2.32.3"	,"Параметры P, Q, A цифровой подписи ГОСТ Р 34.10-94, вариант 1. Могут использоваться также в алгоритме Диффи-Хеллмана" },
	{ "szOID_GostR3410_94_CryptoPro_C_ParamSet",	"1.2.643.2.2.32.4"	,"Параметры P, Q, A цифровой подписи ГОСТ Р 34.10-94, вариант 2. Могут использоваться также в алгоритме Диффи-Хеллмана" },
	{ "szOID_GostR3410_94_CryptoPro_D_ParamSet",	"1.2.643.2.2.32.5"	,"Параметры P, Q, A цифровой подписи ГОСТ Р 34.10-94, вариант 3. Могут использоваться также в алгоритме Диффи-Хеллмана" },
	{ "szOID_GostR3410_94_CryptoPro_XchA_ParamSet",	"1.2.643.2.2.33.1"	,"Параметры P, Q, A алгоритма Диффи-Хеллмана на базе экспоненциальной функции, вариант 1" },
	{ "szOID_GostR3410_94_CryptoPro_XchB_ParamSet",	"1.2.643.2.2.33.2"	,"Параметры P, Q, A алгоритма Диффи-Хеллмана на базе экспоненциальной функции, вариант 2" },
	{ "szOID_GostR3410_94_CryptoPro_XchC_ParamSet",	"1.2.643.2.2.33.3"	,"Параметры P, Q, A алгоритма Диффи-Хеллмана на базе экспоненциальной функции, вариант 3" },
	{ "szOID_GostR3410_2001_TestParamSet",	"1.2.643.2.2.35.0"	,"Тестовые параметры a, b, p, q, (x,y) алгоритма ГОСТ Р 34.10-2001" },
	{ "szOID_GostR3410_2001_CryptoPro_A_ParamSet",	"1.2.643.2.2.35.1"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2001, вариант криптопровайдера" },
	{ "szOID_GostR3410_2001_CryptoPro_B_ParamSet",	"1.2.643.2.2.35.2"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2001, вариант карты КриптоРИК" },
	{ "szOID_GostR3410_2001_CryptoPro_C_ParamSet",	"1.2.643.2.2.35.3"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2001, вариант 1" },
	{ "szOID_GostR3410_2001_CryptoPro_XchA_ParamSet",	"1.2.643.2.2.36.0"	,"Параметры a, b, p, q, (x,y) алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2001, вариант криптопровайдера. Используются те же параметры, что и с идентификатором szOID_GostR3410_2001_CryptoPro_A_ParamSet" },
	{ "szOID_GostR3410_2001_CryptoPro_XchB_ParamSet",	"1.2.643.2.2.36.1"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2001, вариант 1" },
	{ "szOID_tc26_gost_3410_12_256_paramSetA",	"1.2.643.7.1.2.1.1.1"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 256 бит, набор A" },
	{ "szOID_tc26_gost_3410_12_256_paramSetB",	"1.2.643.7.1.2.1.1.2"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 256 бит, набор B" },
	{ "szOID_tc26_gost_3410_12_256_paramSetC",	"1.2.643.7.1.2.1.1.3"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 256 бит, набор C" },
	{ "szOID_tc26_gost_3410_12_256_paramSetD",	"1.2.643.7.1.2.1.1.4"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 256 бит, набор D" },
	{ "szOID_tc26_gost_3410_12_512_paramSetA",	"1.2.643.7.1.2.1.2.1"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 512 бит по умолчанию" },
	{ "szOID_tc26_gost_3410_12_512_paramSetB",	"1.2.643.7.1.2.1.2.2"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 512 бит, набор B" },
	{ "szOID_tc26_gost_3410_12_512_paramSetC",	"1.2.643.7.1.2.1.2.3"	,"Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 512 бит, набор C" }
	};

AlgOidName::AlgOidName()
{
}


AlgOidName::~AlgOidName()
{
}

//Возвращает информацию о данном идентификаторе. Если не найден возвращает-"неизвестно"
string AlgOidName::GetInfo(string val)
{
	string Param; 
	string ParamVal;
	string Info="";

	bool find = false;
	//Ищу данные по OID
	for (int i = 0;i < line_count;i++)
	{
		if (Oid[i][1] == val) //Нашел
		{
			 Param= Oid[i][0];
			 ParamVal= Oid[i][2];
			 find = true;
			break;
		}
	}


	if (find == false) return val+" "+"(неизвестен)";

	Info = val + " ("  + ParamVal + ")";
	return Info;
}

